---
type: UV
namespace: Autodesk.Revit.DB
version: 2024
members: 23
tags: [revit-api, class]
---

# UV

`Autodesk.Revit.DB.UV` · Revit 2024 · 23 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | UV | — | `` |
| Constructor | UV | — | `public UV ()` |
| Method | Add | — | `public UV Add ( UV source )` |
| Method | AngleTo | — | `public double AngleTo ( UV source )` |
| Method | CrossProduct | — | `public double CrossProduct ( UV source )` |
| Method | DistanceTo | — | `public double DistanceTo ( UV source )` |
| Method | Divide | — | `public UV Divide ( double value )` |
| Method | DotProduct | — | `public double DotProduct ( UV source )` |
| Method | GetLength | — | `public double GetLength ()` |
| Method | IsAlmostEqualTo | — | `` |
| Method | IsUnitLength | — | `public bool IsUnitLength ()` |
| Method | IsZeroLength | — | `public bool IsZeroLength ()` |
| Method | Multiply | — | `public UV Multiply ( double value )` |
| Method | Negate | — | `public UV Negate ()` |
| Method | Normalize | — | `public UV Normalize ()` |
| Method | Subtract | — | `public UV Subtract ( UV source )` |
| Method | ToString | — | `public override string ToString ()` |
| Property | BasisU | — | `public static UV BasisU { get ; }` |
| Property | BasisV | — | `public static UV BasisV { get ; }` |
| Property | Item | — | `public double this [ int idx ] { get ; }` |
| Property | U | — | `public double U { get ; }` |
| Property | V | — | `public double V { get ; }` |
| Property | Zero | — | `public static UV Zero { get ; }` |